NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_network.c
/* Copyright (c) 2010 - 2019, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <stdlib.h>

#include "network.h"

#include "unity.h"
#include "cmock.h"

#include "utils.h"
#include "test_assert.h"

#include "log.h"
#include "packet_mesh.h"

#include "core_tx_mock.h"
#include "core_tx_adv_mock.h"
#include "heartbeat_mock.h"
#include "msg_cache_mock.h"
#include "transport_mock.h"
#include "net_beacon_mock.h"
#include "net_state_mock.h"
#include "net_packet_mock.h"
#include "nrf_mesh_externs_mock.h"
#include "friend_internal_mock.h"
#include "manual_mock_queue.h"

#define TOKEN 0x12345678U
#define IV_INDEX 0x87654321U
#define SEQNUM 0xabcdefU

typedef struct
{
    core_tx_alloc_params_t params;
    network_packet_metadata_t metadata;
    uint8_t *p_packet;
    bool success;
} alloc_packet_mock_t;
MOCK_QUEUE_DEF(alloc_packet_mock, alloc_packet_mock_t, NULL);

static core_tx_bearer_bitmap_t core_tx_packet_alloc_mock(const core_tx_alloc_params_t * p_params,
                                                         uint8_t ** pp_packet, int num_calls)
{
    alloc_packet_mock_t expected_alloc;
    alloc_packet_mock_Consume(&expected_alloc);

    UNUSED_PARAMETER(pp_packet);
    UNUSED_PARAMETER(num_calls);

    TEST_ASSERT_EQUAL(expected_alloc.params.role, p_params->role);
    TEST_ASSERT_EQUAL(expected_alloc.params.net_packet_len, p_params->net_packet_len);
    TEST_ASSERT_EQUAL_MEMORY(&expected_alloc.metadata, p_params->p_metadata, sizeof(network_packet_metadata_t));
    TEST_ASSERT_EQUAL(expected_alloc.params.token, p_params->token);
    TEST_ASSERT_EQUAL(expected_alloc.params.bearer_selector, p_params->bearer_selector);

    *pp_packet = expected_alloc.p_packet;

    return expected_alloc.success ? expected_alloc.params.bearer_selector : 0;
}

void setUp(void)
{
    __LOG_INIT(LOG_SRC_NETWORK, LOG_LEVEL_INFO, LOG_CALLBACK_DEFAULT);

    core_tx_mock_Init();
    core_tx_adv_mock_Init();
    heartbeat_mock_Init();
    msg_cache_mock_Init();
    transport_mock_Init();
    net_beacon_mock_Init();
    net_state_mock_Init();
    net_packet_mock_Init();
    nrf_mesh_externs_mock_Init();
    friend_internal_mock_Init();
    alloc_packet_mock_Init();

    core_tx_packet_alloc_StubWithCallback(core_tx_packet_alloc_mock);
}

void tearDown(void)
{
    core_tx_mock_Verify();
    core_tx_mock_Destroy();
    core_tx_adv_mock_Verify();
    core_tx_adv_mock_Destroy();
    heartbeat_mock_Verify();
    heartbeat_mock_Destroy();
    msg_cache_mock_Verify();
    msg_cache_mock_Destroy();
    transport_mock_Verify();
    transport_mock_Destroy();
    net_beacon_mock_Verify();
    net_beacon_mock_Destroy();
    net_state_mock_Verify();
    net_state_mock_Destroy();
    net_packet_mock_Verify();
    net_packet_mock_Destroy();
    nrf_mesh_externs_mock_Verify();
    nrf_mesh_externs_mock_Destroy();
    friend_internal_mock_Verify();
    friend_internal_mock_Destroy();
    alloc_packet_mock_Verify();
    alloc_packet_mock_Destroy();
}
/*****************************************************************************
* Helper functions
*****************************************************************************/
struct
{
    uint16_t src;
    uint16_t dst;
    uint8_t ttl;
    uint32_t calls;
    bool retval;
} m_relay_callback_expect;

static bool relay_callback(uint16_t src, uint16_t dst, uint8_t ttl)
{
    TEST_ASSERT_TRUE(m_relay_callback_expect.calls > 0);
    TEST_ASSERT_EQUAL(m_relay_callback_expect.src, src);
    TEST_ASSERT_EQUAL(m_relay_callback_expect.dst, dst);
    TEST_ASSERT_EQUAL(m_relay_callback_expect.ttl, ttl);
    m_relay_callback_expect.calls--;

    return m_relay_callback_expect.retval;
}

static void packet_alloc_Expect(network_packet_metadata_t * p_metadata,
                                uint32_t packet_len, uint8_t * p_packet,
                                core_tx_role_t role, bool success,
                                core_tx_bearer_selector_t bearer_selector)
{
    alloc_packet_mock_t expect_alloc;
    expect_alloc.params.role               = role;
    expect_alloc.params.net_packet_len     = packet_len;
    expect_alloc.params.token              = (role == CORE_TX_ROLE_ORIGINATOR ? TOKEN : NRF_MESH_RELAY_TOKEN);
    expect_alloc.params.bearer_selector    = bearer_selector;
    expect_alloc.p_packet                  = p_packet;
    expect_alloc.success                   = success;
    expect_alloc.metadata = *p_metadata;

    alloc_packet_mock_Expect(&expect_alloc);
}

static void relay_Expect(network_packet_metadata_t * p_metadata, uint32_t packet_len,
                         packet_mesh_net_packet_t ** pp_relay_packet,
                         core_tx_bearer_selector_t bearer_bitmap)
{
    m_relay_callback_expect.calls  = 1;
    m_relay_callback_expect.dst    = p_metadata->dst.value;
    m_relay_callback_expect.retval = true;
    m_relay_callback_expect.src    = p_metadata->src;
    m_relay_callback_expect.ttl    = p_metadata->ttl;
    uint8_t mic_size               = (p_metadata->control_packet ? 8 : 4);

    static network_packet_metadata_t relay_meta;
    memcpy(&relay_meta, p_metadata, sizeof(relay_meta));
    relay_meta.ttl--;

    packet_alloc_Expect(&relay_meta, packet_len, (uint8_t *) *pp_relay_packet,
                        CORE_TX_ROLE_RELAY, true, bearer_bitmap);
    net_packet_from_payload_ExpectAndReturn(&(*pp_relay_packet)->pdu[9], *pp_relay_packet);
    net_packet_header_set_Expect(*pp_relay_packet, &relay_meta);
    net_packet_encrypt_Expect(&relay_meta, packet_len - 9 - mic_size, *pp_relay_packet, NET_PACKET_KIND_TRANSPORT);
    core_tx_packet_send_Expect();
}

struct
{
    const packet_mesh_trs_packet_t * p_packet;
    uint32_t trs_packet_len;
    network_packet_metadata_t * p_net_metadata;
    const nrf_mesh_rx_metadata_t * p_rx_metadata;
    uint32_t calls;
} m_transport_packet_in_expect;

static uint32_t transport_packet_in_callback(const packet_mesh_trs_packet_t * p_packet,
                                             uint32_t trs_packet_len,
                                             const network_packet_metadata_t * p_net_metadata,
                                             const nrf_mesh_rx_metadata_t * p_rx_metadata,
                                             int calls)
{
    TEST_ASSERT_EQUAL(m_transport_packet_in_expect.trs_packet_len, trs_packet_len);
    if (trs_packet_len > 0)
    {
        TEST_ASSERT_EQUAL_HEX8_ARRAY(m_transport_packet_in_expect.p_packet, p_packet, trs_packet_len);
    }
    /* Metadata has padding, so we have to compare the fields individually */
    TEST_ASSERT_EQUAL(m_transport_packet_in_expect.p_net_metadata->control_packet, p_net_metadata->control_packet);
    TEST_ASSERT_EQUAL(m_transport_packet_in_expect.p_net_metadata->dst.type, p_net_metadata->dst.type);
    TEST_ASSERT_EQUAL(m_transport_packet_in_expect.p_net_metadata->dst.value, p_net_metadata->dst.value);
    TEST_ASSERT_EQUAL(m_transport_packet_in_expect.p_net_metadata->internal.iv_index, p_net_metadata->internal.iv_index);
    TEST_ASSERT_EQUAL(m_transport_packet_in_expect.p_net_metadata->internal.sequence_number, p_net_metadata->internal.sequence_number);
    TEST_ASSERT_EQUAL(m_transport_packet_in_expect.p_net_metadata->p_security_material, p_net_metadata->p_security_material);
    TEST_ASSERT_EQUAL(m_transport_packet_in_expect.p_net_metadata->src, p_net_metadata->src);
    TEST_ASSERT_EQUAL(m_transport_packet_in_expect.p_net_metadata->ttl, p_net_metadata->ttl);
    TEST_ASSERT_EQUAL(m_transport_packet_in_expect.p_rx_metadata, p_rx_metadata);
    TEST_ASSERT_TRUE(m_transport_packet_in_expect.calls > 0);
    m_transport_packet_in_expect.calls--;
    return 0x12345678;
}

