NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_network.c
/** Copy of the implementation from nrf_mesh_utils.c. Pulled in to avoid build problems with the other functions in that module */
nrf_mesh_address_type_t nrf_mesh_address_type_get(uint16_t address)
{
    if (address == NRF_MESH_ADDR_UNASSIGNED)
    {
        return NRF_MESH_ADDRESS_TYPE_INVALID;
    }
    else
    {
        static const nrf_mesh_address_type_t types_lookup[] =
        {
            NRF_MESH_ADDRESS_TYPE_UNICAST, /* 0b00 */
            NRF_MESH_ADDRESS_TYPE_UNICAST, /* 0b01 */
            NRF_MESH_ADDRESS_TYPE_VIRTUAL, /* 0b10 */
            NRF_MESH_ADDRESS_TYPE_GROUP,   /* 0b11 */
        };
        return types_lookup[(address & NRF_MESH_ADDR_TYPE_BITS_MASK) >> NRF_MESH_ADDR_TYPE_BITS_OFFSET];
    }
}
/*****************************************************************************
* Test functions
*****************************************************************************/
void test_init(void)
{
    net_beacon_init_Expect();
    net_state_recover_from_flash_Expect();
    net_state_init_Expect();
    nrf_mesh_init_params_t init_params = {{0}};
    network_init(&init_params);

    net_beacon_init_Expect();
    net_state_recover_from_flash_Expect();
    net_state_init_Expect();
    init_params.relay_cb = relay_callback;
    network_init(&init_params);
}

void test_enable(void)
{
    net_state_enable_Expect();
    net_beacon_enable_Expect();
    network_enable();
}

void test_alloc(void)
{
    struct
    {
        uint16_t src;
        uint16_t dst;
        uint8_t ttl;
        bool control;
        uint8_t payload_len;
        bool core_tx_alloc_ok;
        bool seqnum_alloc_ok;
    } vector[] = {
        {0x0001, 0x0002, 8, false, 10, true, true},
        {0x0001, 0x0002, 8, false, 10, false, true}, /* No packets available */
        {0x0001, 0x0002, 8, false, 10, true, false}, /* No seqnum available */
    };
    nrf_mesh_network_secmat_t secmat;
    network_packet_metadata_t metadata;
    network_tx_packet_buffer_t buffer;
    uint8_t payload[PACKET_MESH_NET_MAX_SIZE];
    uint8_t * p_packet = payload;
    memset(secmat.encryption_key, 0xEC, NRF_MESH_KEY_SIZE);
    memset(secmat.privacy_key, 0x93, NRF_MESH_KEY_SIZE);
    secmat.nid = 0xAA;
    buffer.user_data.p_metadata         = &metadata;
    buffer.user_data.token              = TOKEN;
    buffer.user_data.role               = CORE_TX_ROLE_ORIGINATOR;
    buffer.user_data.bearer_selector    = CORE_TX_BEARER_TYPE_ALLOW_ALL;
    metadata.p_security_material = &secmat;

    for (volatile uint32_t i = 0; i < ARRAY_SIZE(vector); ++i)
    {
        metadata.control_packet      = vector[i].control;
        metadata.dst.value           = vector[i].dst;
        metadata.dst.type =
            (vector[i].dst < 0x8000) ? NRF_MESH_ADDRESS_TYPE_UNICAST : NRF_MESH_ADDRESS_TYPE_GROUP;
        metadata.src                 = vector[i].src;
        metadata.ttl                 = vector[i].ttl;
        buffer.user_data.payload_len = vector[i].payload_len;

        packet_alloc_Expect(&metadata,
                            vector[i].payload_len + 9 + (vector[i].control ? 8 : 4),
                            p_packet,
                            CORE_TX_ROLE_ORIGINATOR,
                            vector[i].core_tx_alloc_ok,
                            CORE_TX_BEARER_TYPE_ALLOW_ALL);

        if (vector[i].core_tx_alloc_ok)
        {
            uint32_t seqnum = SEQNUM;
            net_state_tx_iv_index_get_ExpectAndReturn(IV_INDEX);
            net_state_seqnum_alloc_ExpectAndReturn(&metadata.internal.sequence_number,
                                                   vector[i].seqnum_alloc_ok ? NRF_SUCCESS
                                                                             : NRF_ERROR_FORBIDDEN);
            net_state_seqnum_alloc_ReturnMemThruPtr_p_seqnum(&seqnum, sizeof(seqnum));


            if (vector[i].seqnum_alloc_ok)
            {
                net_packet_header_set_Expect((packet_mesh_net_packet_t *) p_packet, &metadata);
                TEST_ASSERT_EQUAL(NRF_SUCCESS, network_packet_alloc(&buffer));
                TEST_ASSERT_EQUAL_PTR(&payload[9], buffer.p_payload);
            }
            else
            {
                core_tx_packet_discard_Expect();
                TEST_ASSERT_EQUAL(NRF_ERROR_FORBIDDEN, network_packet_alloc(&buffer));
            }
        }
        else
        {
            TEST_ASSERT_EQUAL(NRF_ERROR_NO_MEM, network_packet_alloc(&buffer));
        }
        net_state_mock_Verify();
        core_tx_mock_Verify();
    }
    /* Invalid params not covered by vectors */
    TEST_NRF_MESH_ASSERT_EXPECT(network_packet_alloc(NULL));
    metadata.p_security_material = NULL;
    TEST_NRF_MESH_ASSERT_EXPECT(network_packet_alloc(&buffer));
    buffer.user_data.p_metadata = NULL;
    TEST_NRF_MESH_ASSERT_EXPECT(network_packet_alloc(&buffer));
    buffer.user_data.p_metadata = &metadata;
    metadata.p_security_material = &secmat;
    buffer.user_data.role = CORE_TX_ROLE_COUNT; // too high
    TEST_NRF_MESH_ASSERT_EXPECT(network_packet_alloc(&buffer));

}

void test_send(void)
{
    nrf_mesh_network_secmat_t secmat;
    network_packet_metadata_t metadata;
    network_tx_packet_buffer_t buffer;
    packet_mesh_net_packet_t packet;
    uint16_t dst = 0x1234;
    uint8_t len  = 10;

    for (uint32_t control = 0; control < 2U; ++control)
    {
        metadata.dst.value                = dst;
        metadata.p_security_material      = &secmat;
        metadata.internal.iv_index        = IV_INDEX;
        metadata.internal.sequence_number = SEQNUM;
        metadata.control_packet           = control;

        net_packet_from_payload_ExpectAndReturn(&packet.pdu[9], &packet);
        net_packet_encrypt_Expect(&metadata, len, &packet, NET_PACKET_KIND_TRANSPORT);

        buffer.user_data.p_metadata  = &metadata;
        buffer.user_data.token       = TOKEN;
        buffer.user_data.payload_len = len;
        buffer.user_data.role        = CORE_TX_ROLE_ORIGINATOR;
        buffer.p_payload             = &packet.pdu[9];
        core_tx_packet_send_Expect();

        network_packet_send(&buffer);
    }
    /* Invalid params */
    TEST_NRF_MESH_ASSERT_EXPECT(network_packet_send(NULL));
    buffer.p_payload = NULL;
    TEST_NRF_MESH_ASSERT_EXPECT(network_packet_send(&buffer));
    buffer.p_payload = &packet.pdu[9];
    buffer.user_data.p_metadata->p_security_material = NULL;
    TEST_NRF_MESH_ASSERT_EXPECT(network_packet_send(&buffer));
    buffer.user_data.p_metadata = NULL;
    TEST_NRF_MESH_ASSERT_EXPECT(network_packet_send(&buffer));
    buffer.user_data.p_metadata = &metadata;
    buffer.user_data.bearer_selector = CORE_TX_BEARER_TYPE_INVALID;
    TEST_NRF_MESH_ASSERT_EXPECT(network_packet_send(&buffer));
}

void test_discard(void)
{
    uint8_t payload[PACKET_MESH_NET_MAX_SIZE];
    network_packet_metadata_t metadata;
    network_tx_packet_buffer_t buffer;
    metadata.control_packet      = false;
    buffer.user_data.p_metadata  = &metadata;
    buffer.user_data.token       = TOKEN;
    buffer.user_data.payload_len = 10;
    buffer.user_data.role        = CORE_TX_ROLE_ORIGINATOR;
    buffer.p_payload             = &payload[9];

