NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_network.c
    for (uint32_t control = 0; control < 2U; ++control)
    {
        metadata.control_packet    = control;
        core_tx_packet_discard_Expect();
        network_packet_discard(&buffer);
    }
}

/**
 * Test packet in function, to make sure it parses the header and calls the encryption module
 * correctly, as well as discarding packets correctly.
 *
 * The packet in procedure works like this:
 * 1: Decrypt the packet
 * 2: Send to transport
 * 3: add to message cache
 * 4: translate friendship secmat
 * 5: Relay if possible
 *
 * Note: some test cases may emulate failure scenarios that can cause early return.
 */
void test_packet_in(void)
{
    nrf_mesh_network_secmat_t secmat;
    secmat.nid = 0xAF;
    typedef enum {
        STEP_DECRYPTION,
        STEP_SELF_SENDING,
        STEP_DO_RELAY,
        STEP_SUCCESS,
    } step_t;
    struct
    {
        network_packet_metadata_t meta;
        uint32_t length;
        step_t fail_step; /**< The step where the packet processing stops, or STEP_SUCCESS if it goes through all the steps */
    } vector[] = {
        {{{NRF_MESH_ADDRESS_TYPE_GROUP, 0xFFFF}, 0x0001, 5, false, {SEQNUM, IV_INDEX}, &secmat}, 18, STEP_SUCCESS}, /* access packet */
        {{{NRF_MESH_ADDRESS_TYPE_GROUP, 0xFFFF}, 0x0001, 5, false, {SEQNUM, IV_INDEX}, &secmat}, 18, STEP_DECRYPTION}, /* access packet */
        {{{NRF_MESH_ADDRESS_TYPE_GROUP, 0xFFFF}, 0x0001, 5, true, {SEQNUM, IV_INDEX}, &secmat}, 18, STEP_SUCCESS}, /* Control packet */
        {{{NRF_MESH_ADDRESS_TYPE_UNICAST, 0x0002}, 0x0001, 5, false, {SEQNUM, IV_INDEX}, &secmat}, 18, STEP_SUCCESS}, /* Unicast DST */
        {{{NRF_MESH_ADDRESS_TYPE_UNICAST, 0x0002}, 0x0001, 5, false, {SEQNUM, IV_INDEX}, &secmat}, 9+4, STEP_SUCCESS}, /* just long enough */
        {{{NRF_MESH_ADDRESS_TYPE_UNICAST, 0x0002}, 0x0001, 5, false, {SEQNUM, IV_INDEX}, &secmat}, 9+7, STEP_SUCCESS}, /* long enough for a data packet */
        {{{NRF_MESH_ADDRESS_TYPE_UNICAST, 0x0002}, 0x0001, 5, true, {SEQNUM, IV_INDEX}, &secmat}, 9+8, STEP_SUCCESS}, /* just long enough */
        {{{NRF_MESH_ADDRESS_TYPE_UNICAST, 0x0002}, 0x0001, 5, false, {SEQNUM, IV_INDEX}, &secmat}, 18, STEP_DO_RELAY}, /* Packet is for this device, shouldn't relay */
        {{{NRF_MESH_ADDRESS_TYPE_UNICAST, 0x0002}, 0x0001, 1, false, {SEQNUM, IV_INDEX}, &secmat}, 18, STEP_DO_RELAY}, /* TTL too low to relay */
        {{{NRF_MESH_ADDRESS_TYPE_UNICAST, 0x0002}, 0x0001, 5, false, {SEQNUM, IV_INDEX}, &secmat}, 18, STEP_SUCCESS},
        {{{NRF_MESH_ADDRESS_TYPE_UNICAST, 0x0002}, 0x0001, 5, false, {SEQNUM, IV_INDEX}, &secmat}, 18, STEP_SELF_SENDING}, /* It is own src address. Stop handling to prevent relay loops */
        {{{NRF_MESH_ADDRESS_TYPE_VIRTUAL, 0x8000}, 0x0001, 5, true, {SEQNUM, IV_INDEX}, &secmat}, 18, STEP_DECRYPTION}, /* Virual address used in control packet */
    };
    nrf_mesh_rx_metadata_t rx_meta;

    for (uint32_t i = 0; i < ARRAY_SIZE(vector); ++i)
    {
        packet_mesh_net_packet_t relay_packet;
        packet_mesh_net_packet_t * p_relay_packet = &relay_packet;
        packet_mesh_net_packet_t net_packet;
        uint8_t mic_len = vector[i].meta.control_packet ? 8 : 4;
        memset(&net_packet, 0xAB, sizeof(net_packet));
        memset(&m_transport_packet_in_expect, 0, sizeof(m_transport_packet_in_expect));

        net_packet_obfuscation_start_get_ExpectAndReturn(&net_packet, &net_packet.pdu[1]);

        /* 1: Decrypt */
        net_packet_decrypt_ExpectAndReturn(NULL,
                                           vector[i].length,
                                           &net_packet,
                                           NULL,
                                           NET_PACKET_KIND_TRANSPORT,
                                           ((vector[i].fail_step > STEP_DECRYPTION)
                                                ? NRF_SUCCESS
                                                : NRF_ERROR_NOT_FOUND));

        net_packet_decrypt_IgnoreArg_p_net_decrypted_packet();
        net_packet_decrypt_ReturnMemThruPtr_p_net_decrypted_packet(&net_packet, vector[i].length);

        net_packet_decrypt_IgnoreArg_p_net_metadata();
        net_packet_decrypt_ReturnThruPtr_p_net_metadata(&vector[i].meta);

        if (vector[i].fail_step > STEP_DECRYPTION)
        {
            /* 2: Send to transport */
            net_packet_payload_len_get_ExpectAndReturn(&vector[i].meta,
                                                       vector[i].length,
                                                       vector[i].length - 9 - mic_len);
            transport_packet_in_StubWithCallback(transport_packet_in_callback);

            m_transport_packet_in_expect.p_packet = (const packet_mesh_trs_packet_t *) &net_packet.pdu[9];
            m_transport_packet_in_expect.trs_packet_len =
                vector[i].length - 9 - mic_len;
            m_transport_packet_in_expect.p_net_metadata = &vector[i].meta;
            m_transport_packet_in_expect.p_rx_metadata  = &rx_meta;
            m_transport_packet_in_expect.calls          = 1;

            /* 3: Add to message cache */
            msg_cache_entry_add_Expect(vector[i].meta.src, vector[i].meta.internal.sequence_number);

            /* 4: Check friendship secmat translation. */
            friend_friendship_established_ExpectAnyArgsAndReturn(false);

            /* 5: Relay if needed: */
            nrf_mesh_rx_address_get_ExpectAndReturn(vector[i].meta.src, NULL, (vector[i].fail_step == STEP_SELF_SENDING));
            nrf_mesh_rx_address_get_IgnoreArg_p_address();

            if (vector[i].fail_step > STEP_SELF_SENDING)
            {
                core_tx_adv_is_enabled_ExpectAndReturn(CORE_TX_ROLE_RELAY, true);
            }

            if (vector[i].meta.ttl >= 2 && vector[i].fail_step > STEP_SELF_SENDING)
            {
                core_tx_bearer_type_t bearer_selector = CORE_TX_BEARER_TYPE_ALLOW_ALL & ~CORE_TX_BEARER_TYPE_LOCAL;

                if (vector[i].meta.dst.type == NRF_MESH_ADDRESS_TYPE_UNICAST)
                {
                    nrf_mesh_rx_address_get_ExpectAndReturn(vector[i].meta.dst.value,
                                                            NULL,
                                                            (vector[i].fail_step == STEP_DO_RELAY));
                    nrf_mesh_rx_address_get_IgnoreArg_p_address();
                }
                if (vector[i].fail_step > STEP_DO_RELAY)
                {
                    relay_Expect(&vector[i].meta, vector[i].length, &p_relay_packet,
                                 bearer_selector);
                }
            }

