NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_network.c
        }

        network_packet_in(net_packet.pdu, vector[i].length, &rx_meta);

        TEST_ASSERT_EQUAL(0, m_transport_packet_in_expect.calls);
        TEST_ASSERT_EQUAL(0, m_relay_callback_expect.calls);
        core_tx_mock_Verify();
        transport_mock_Verify();
        nrf_mesh_externs_mock_Verify();
        net_packet_mock_Verify();
        friend_internal_mock_Verify();
    }
}

/* This is slightly modified version of test_packet_in, to explicitly test secmat translation */
void test_packet_in_friendship_secmat_translation(void)
{
    TEST_ASSERT_EQUAL(1, MESH_FEATURE_FRIEND_ENABLED);
    TEST_ASSERT_EQUAL(1, MESH_FEATURE_RELAY_ENABLED);

    nrf_mesh_network_secmat_t secmat;
    nrf_mesh_network_secmat_t secmat_new;
    network_packet_metadata_t relay_expect_meta;

    secmat.nid = 0x70;
    secmat_new.nid = 0x07;
    typedef enum {
        STEP_DECRYPTION,
        STEP_DO_RELAY,
        STEP_SUCCESS,
    } step_t;
    struct
    {
        network_packet_metadata_t meta;
        uint32_t length;
        step_t fail_step; /**< The step where the packet processing stops, or STEP_SUCCESS if it goes through all the steps */
    } vector[] = {
        {{{NRF_MESH_ADDRESS_TYPE_GROUP, 0xFFFF}, 0x0001, 5, false, {SEQNUM, IV_INDEX}, &secmat}, 18, STEP_SUCCESS}, /* access packet */
        {{{NRF_MESH_ADDRESS_TYPE_GROUP, 0xC001}, 0x0003, 5, true, {SEQNUM, IV_INDEX}, &secmat}, 18, STEP_SUCCESS},  /* Control packet */
        {{{NRF_MESH_ADDRESS_TYPE_UNICAST, 0x0002}, 0x0004, 5, false, {SEQNUM, IV_INDEX}, &secmat}, 18, STEP_SUCCESS} /* Unicast DST */
    };
    nrf_mesh_rx_metadata_t rx_meta;

    for (uint32_t i = 0; i < ARRAY_SIZE(vector); ++i)
    {
        packet_mesh_net_packet_t relay_packet;
        packet_mesh_net_packet_t * p_relay_packet = &relay_packet;
        packet_mesh_net_packet_t net_packet;
        uint8_t mic_len = vector[i].meta.control_packet ? 8 : 4;
        memset(&net_packet, 0xAB, sizeof(net_packet));

        net_packet_obfuscation_start_get_ExpectAndReturn(&net_packet, &net_packet.pdu[1]);

        /* 1: Decrypt */
        net_packet_decrypt_ExpectAndReturn(NULL,
                                           vector[i].length,
                                           &net_packet,
                                           NULL,
                                           NET_PACKET_KIND_TRANSPORT,
                                           ((vector[i].fail_step > STEP_DECRYPTION)
                                                ? NRF_SUCCESS
                                                : NRF_ERROR_NOT_FOUND));

        net_packet_decrypt_IgnoreArg_p_net_decrypted_packet();
        net_packet_decrypt_ReturnMemThruPtr_p_net_decrypted_packet(&net_packet, vector[i].length);

        net_packet_decrypt_IgnoreArg_p_net_metadata();
        net_packet_decrypt_ReturnThruPtr_p_net_metadata(&vector[i].meta);

        TEST_ASSERT_TRUE(vector[i].fail_step > STEP_DECRYPTION);

        /* 2: Send to transport */
        net_packet_payload_len_get_ExpectAndReturn(&vector[i].meta,
                                                    vector[i].length,
                                                    vector[i].length - 9 - mic_len);
        transport_packet_in_StubWithCallback(transport_packet_in_callback);

        m_transport_packet_in_expect.p_packet = (const packet_mesh_trs_packet_t *) &net_packet.pdu[9];
        m_transport_packet_in_expect.trs_packet_len =
            vector[i].length - 9 - mic_len;
        m_transport_packet_in_expect.p_net_metadata = &vector[i].meta;
        m_transport_packet_in_expect.p_rx_metadata  = &rx_meta;
        m_transport_packet_in_expect.calls          = 1;
        core_tx_adv_is_enabled_ExpectAndReturn(CORE_TX_ROLE_RELAY, true);

        /* 3: Add to message cache */
        msg_cache_entry_add_Expect(vector[i].meta.src, vector[i].meta.internal.sequence_number);

        /* 4: Check friendship secmat translation. Each switch case checks different test case */
        TEST_ASSERT_EQUAL(3, ARRAY_SIZE(vector));
        relay_expect_meta = vector[i].meta;
        switch (i)
        {
            /* Test: Friendship established returns false */
            case 0:
                friend_friendship_established_ExpectAndReturn(vector[i].meta.src, false);
                break;

            /* Test: Friendship established returns true, secmat get returns NULL. */
            case 1:
                friend_friendship_established_ExpectAndReturn(vector[i].meta.src, true);
                nrf_mesh_net_master_secmat_get_ExpectAndReturn(vector[i].meta.p_security_material, NULL);
                break;

            /* Test: Friendship established returns true, secmat get returns some other secmat */
            case 2:
                friend_friendship_established_ExpectAndReturn(vector[i].meta.src, true);
                nrf_mesh_net_master_secmat_get_ExpectAndReturn(vector[i].meta.p_security_material, &secmat_new);
                relay_expect_meta.p_security_material = &secmat_new;
                break;

            /* There are no more than 3 test cases. Vector size is larger than the test scenarios. */
            default:
                TEST_ASSERT_TRUE(false);
        }

        /* 5: Always expect relaying, so that we can check the secmat. */
        nrf_mesh_rx_address_get_ExpectAndReturn(vector[i].meta.src, NULL, false);
        nrf_mesh_rx_address_get_IgnoreArg_p_address();
        TEST_ASSERT_TRUE(vector[i].meta.ttl >= 2);
        if (vector[i].meta.dst.type == NRF_MESH_ADDRESS_TYPE_UNICAST)
        {
            nrf_mesh_rx_address_get_ExpectAndReturn(vector[i].meta.dst.value,
                                                    NULL,
                                                    (vector[i].fail_step == STEP_DO_RELAY));
            nrf_mesh_rx_address_get_IgnoreArg_p_address();
        }

        TEST_ASSERT_TRUE(vector[i].fail_step > STEP_DO_RELAY);
        relay_Expect(&relay_expect_meta, vector[i].length, &p_relay_packet, CORE_TX_BEARER_TYPE_ALLOW_ALL & ~CORE_TX_BEARER_TYPE_LOCAL);

        network_packet_in(net_packet.pdu, vector[i].length, &rx_meta);

        TEST_ASSERT_EQUAL(0, m_transport_packet_in_expect.calls);
        TEST_ASSERT_EQUAL(0, m_relay_callback_expect.calls);
        core_tx_mock_Verify();
        transport_mock_Verify();
        nrf_mesh_externs_mock_Verify();
        net_packet_mock_Verify();
        friend_internal_mock_Verify();
    }
}

